---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.Dispose
source: html/fe940cfb-e1c6-1da7-ea30-00c8401c09e9.htm
---
# Autodesk.Revit.DB.IFC.IFCData.Dispose Method

Releases all resources used by the IFCData

## Syntax (C#)
```csharp
public void Dispose()
```